read_verilog -lib /usr/local/share/yosys/ice40/cells_sim.v test_syn.v;
hierarchy -check -top top;
proc;
opt;
fsm;
opt;
techmap;
opt;
dfflibmap -liberty /usr/local/share/yosys/cells.lib;
abc -liberty /usr/local/share/yosys/cells.lib;
show;
